package com.kh.object.basic;

public class OOP {

	public static void main(String[] args) {
		/*
		 * OOP(Object-Oriented Programing) : 객체지향 프로그래밍
		 * 
		 * 객체들의 상호작용으로 모델링하여 프로그램을 구성하는 설계방식
		 * 객체 : 목적과 가치를 가지고있어, 독자적으로 식별 가능한 것
		 * 
		 * 추상화 : 문제해결에 필요한 속성과 기능으로 대상을 단순화 하는 과정
		 * -> 클래스 : 추상화의 결과물, 객체의 설계도
		 * -> 인스턴스 객체 : 클래스로부터 new 키워드를 통해 생성된 실제 메모리를 가진 객체
		 * 
		 * 1. 만들고자 하는 시스템에 필요한 객체들을 구상
		 * 2. 객체들의 공통적인 속성과 기능을 정의
		 * 3. 구현하고자 하는 프로그램의 목적에 맞게 요소들을 선별
		 * 4. 선별된 요소들에게 알맞은 자료형, 변수명을 배정
		 */
	}

}
